export function poetry(verse) {
  if (typeof verse === 's' && verse.length === 0) {
    return "!لطفا یک شعر وارد نمایید";
  }
  const poems = {
    ا: "ای خوشا مستانه سر در پای دلبر داشتن - دل تهی از خوب و زشت چرخ اخضر داشتن",
    آ: "ای خوشا مستانه سر در پای دلبر داشتن - دل تهی از خوب و زشت چرخ اخضر داشتن",
    ٴ: "ای خوشا مستانه سر در پای دلبر داشتن - دل تهی از خوب و زشت چرخ اخضر داشتن",
    ب: "به لاله نرگس مخمور گفت وقت سحر - که هر که در صف باغ است صاحب هنریست",
    پ: "پیام داد سگ گله را، شبی گرگی - که صبحدم بره بفرست، میهمان دارم",
    ت: "تا بکی جان کندن اندر آفتاب ای رنجبر - ریختن از بهر نان از چهر آب ای رنجبر",
    ث: null,
    ج: "جهاندیده کشاورزی بدشتی - بعمری داشتی زرعی و کشتی",
    چ: "چو رنگ از رخ روز، پرواز کرد - شباویز، نالیدن آغاز کرد",
    ح: "حکایت کرد سرهنگی به کسری - که دشمن را ز پشت قلعه راندیم",
    خ: "خمید نرگس پژمرده‌ای ز انده و شرم - چو دید جلوهٔ گلهای بوستانی را",
    د: "دید موری در رهی پیلی سترگ - گفت باید بود چون پیلان بزرگ",
    ذ: null,
    ر: "روزی گذشت پادشهی از گذرگهی - فریاد شوق بر سر هر کوی و بام خاست",
    ز: "ز سری، موی سپیدی روئید - خنده‌ها کرد بر او موی سیاه",
    ژ: null,
    س: "سخن گفت با خویش، دلوی بنخوت - که بی من، کس از چه ننوشیده آبی",
    ش: "شنیده‌اید که آسایش بزرگان چیست: - برای خاطر بیچارگان نیاسودن",
    ص: "صبحدم، صاحبدلی در گلشنی - شد روان بهر نظاره کردنی",
    ض: null,
    ط: "طائری کز آشیان، پرواز بهر آز کرد - کیفرش، فرجام بال و پر بخون آلودن است",
    ظ: null,
    ع: "عالمی طعنه زد به نادانی - که بهر موی من دو صد هنر است",
    غ: "غنچه‌ای گفت به پژمرده گلی - که ز ایام، دلت زود آزرد",
    ف: "فتاد طائری از لانه و ز درد تپید - بزیر پر چو نگه کرد، دید پیکانی است",
    ق: "قاضی کشمر ز محضر، شامگاه - رفت سوی خانه با حالی تباه",
    ک: "کبوتر بچه‌ای با شوق پرواز - بجرئت کرد روزی بال و پر باز",
    گ: "گفت تیری با کمان، روز نبرد - کاین ستمکاری تو کردی، کس نکرد",
    ل: "لاله‌ای با نرگس پژمرده گفت - بین که ما رخساره چون افروختیم",
    م: "مرغی نهاد روی بباغی ز خرمنی - ناگاه دید دانهٔ لعلی به روزنی",
    ن: "نهال تازه رسی گفت با درختی خشک - که از چه روی، ترا هیچ برگ و باری نیس",
    و: "وقت سحر، به آینه‌ای گفت شانه‌ای - کاوخ! فلک چه کجرو و گیتی چه تند خوست",
    ه: null,
    ی: "یکی مرغ زیرک، ز کوتاه بامی - نظر کرد روزی، بگسترده دامی",
  };
  let result = null;
  let letter = verse[verse.length - 1];
  result = poems[letter];
  if (result == null) {
    let halfPoem = [];
    if (verse.includes("-")) {
      halfPoem = verse.split("-");
    } else {
      halfPoem = verse.split("  ");
    }
    letter = halfPoem[0].at(-1);
    result = poems[letter];
  }
  return result;
}
export default poetry;
